# Flip Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..Flip Method
FabricationPart Class See Also
---
Flips the fabrication part that is directionally oriented (tees, crosses, valves, dampers, etc.) to the opposite direction.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public bool Flip()
```

Visual Basic
---
```text
Public Function Flip As Boolean
```

Visual C++
---
```text
public:
bool Flip()
```

# ### Return Value
Returns true if successful otherwise false if the fabrication part cannot be flipped.
# Remarks
Existing connections will be maintained, disconnect warnings will be posted if the connection cannot be maintained.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | It is not a valid part that can be flipped. |

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace